InformationRegisters/атл_ДетальныйГрафикРаботыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>атл_ДетальныйГрафикРаботыСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/атл_ДетальныйГрафикРаботыСотрудников/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЕстьОшибкаВДанных = Ложь;
	
	Если Не ЗначениеЗаполнено(Запись.ВремяНачала) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите время начала!";
		Сообщение.Поле = "Запись.ВремяНачала";		
		Сообщение.Сообщить();
		
		ЕстьОшибкаВДанных = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.ВремяОкончания) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите время окончания!";
		Сообщение.Поле = "Запись.ВремяОкончания";		
		Сообщение.Сообщить();
		
		ЕстьОшибкаВДанных = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.Сотрудник) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите сотрудника!";
		Сообщение.Поле = "Запись.Сотрудник";		
		Сообщение.Сообщить();
		
		ЕстьОшибкаВДанных = Истина;
	КонецЕсли;
	
	Если ЕстьОшибкаВДанных Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Запись.ВремяНачала > Запись.ВремяОкончания Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Время начала не может быть больше времени окончания! Исправьте время!";		
		Сообщение.Сообщить();
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		Запись.ДатаЗаписи = ТекущаяДата();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.ВремяНачала) Тогда
		Если НачалоДня(Запись.ВремяОкончания) <> НачалоДня(Запись.ВремяНачала) Тогда
			Запись.ВремяОкончания = НачалоДня(Запись.ВремяНачала) + Формат(Запись.ВремяОкончания, "ДФ=ЧЧ; ДП=0") * 3600 + Формат(Запись.ВремяОкончания, "ДФ=мм; ДП=0") * 60 +  + Формат(Запись.ВремяОкончания, "ДФ=сс; ДП=0")
		КонецЕсли;
		
		Если Запись.ВремяОкончания < Запись.ВремяНачала Тогда
			Запись.ВремяОкончания = Запись.ВремяНачала;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.ВремяОкончания) Тогда
		Если НачалоДня(Запись.ВремяНачала) <> НачалоДня(Запись.ВремяОкончания) Тогда
			Запись.ВремяНачала = НачалоДня(Запись.ВремяОкончания) + Формат(Запись.ВремяНачала, "ДФ=ЧЧ; ДП=0") * 3600 + Формат(Запись.ВремяНачала, "ДФ=мм; ДП=0") * 60 +  + Формат(Запись.ВремяНачала, "ДФ=сс; ДП=0")
		КонецЕсли;
		
		Если Запись.ВремяНачала > Запись.ВремяОкончания Тогда
			Запись.ВремяНачала = Запись.ВремяОкончания;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаписиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.ВремяНачала) Тогда
		Если НачалоДня(Запись.ВремяОкончания) <> НачалоДня(Запись.ВремяНачала) Тогда
			Запись.ВремяНачала = НачалоДня(Запись.ВремяОкончания) + Формат(Запись.ВремяНачала, "ДФ=ЧЧ; ДП=0") * 3600 + Формат(Запись.ВремяНачала, "ДФ=мм; ДП=0") * 60 +  + Формат(Запись.ВремяНачала, "ДФ=сс; ДП=0")
		КонецЕсли;
		
		Если Запись.ВремяНачала > Запись.ВремяОкончания Тогда
			Запись.ВремяНачала = Запись.ВремяОкончания;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
